# _*_ coding    : UTF8 _*_
# Author        : ZnYang
# Creation Time : 2021/1/15 11:37
# File Name     : ex03.py
# Dev Tool      : PyCharm
data = [
    {'商品号': '01', '商品名': '电风扇', '单位': '美的', '单价': 500},
    {'商品号': '02', '商品名': '洗衣机', '单位': 'TCL', '单价': 1000},
    {'商品号': '03', '商品名': '冰箱', '单位': '海尔', '单价': 1500},
    {'商品号': '04', '商品名': '电视', '单位': '创维', '单价': 2000},
    {'商品号': '05', '商品名': '空调', '单位': '伊克萨斯', '单价': 200},
    {'商品号': '06', '商品名': '微波炉', '单位': '老板', '单价': 1000}
]

for item in data:
    print('{:0>6}\t{}\t{}\t\t￥{:.2f}'.format(item['商品号'], item['商品名'], item['单位'], item['单价']))
